Tutorials-3.0.0/MRF/LTS/Allrun
#!/bin/sh

./makeMesh
rm -rf log; pisoCentralFoam | tee -a log;
